; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_1 ?v8 - type_3 ?v5 - type_2)
 	      (pred_4 ?v1 - object ?v5 - type_2)
	      (pred_2 ?v8 - type_3 ?v7 - type_1)
	      (pred_3 ?v8 - type_3 ?v1 - object ?v7 - type_1))

   (:action op_1
       :parameters  (?v8 - type_3 ?v2 ?v6 - type_2)
       :precondition (and  (pred_1 ?v8 ?v2))
       :effect (and  (pred_1 ?v8 ?v6)
		     (not (pred_1 ?v8 ?v2))))

   (:action op_3
       :parameters (?v8 - type_3 ?v4 - object ?v3 - type_2 ?v7 - type_1)
       :precondition  (and  (pred_4 ?v4 ?v3) (pred_1 ?v8 ?v3) (pred_2 ?v8 ?v7))
       :effect (and (pred_3 ?v8 ?v4 ?v7)
		    (not (pred_4 ?v4 ?v3)) 
		    (not (pred_2 ?v8 ?v7))))

   (:action op_2
       :parameters (?v8 - type_3 ?v4 - object ?v3 - type_2 ?v7 - type_1)
       :precondition  (and  (pred_3 ?v8 ?v4 ?v7) (pred_1 ?v8 ?v3))
       :effect (and (pred_4 ?v4 ?v3)
		    (pred_2 ?v8 ?v7)
		    (not (pred_3 ?v8 ?v4 ?v7)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_08 obj_10 - type_3
obj_07 obj_04 obj_06 obj_09 - type_1
obj_11 obj_02 obj_01 obj_14 - type_2
obj_05 obj_13 obj_12 obj_03 - object)
(:init
(pred_1 obj_08 obj_11)
(pred_2 obj_08 obj_07)
(pred_2 obj_08 obj_04)
(pred_1 obj_10 obj_11)
(pred_2 obj_10 obj_06)
(pred_2 obj_10 obj_09)
(pred_4 obj_05 obj_01)
(pred_4 obj_13 obj_11)
(pred_4 obj_12 obj_01)
(pred_4 obj_03 obj_02)
)
(:goal
(and
(pred_4 obj_05 obj_01)
(pred_4 obj_13 obj_11)
(pred_4 obj_12 obj_02)
(pred_4 obj_03 obj_01)
)
)

(:constraints
  (always (not (pred_1 obj_08 obj_01)))
)
)

; plan
1. (op_1 obj_08 obj_11 obj_02)
   deleted: (pred_1 obj_08 obj_11)
   added: (pred_1 obj_08 obj_02)
   goals met: 2 of 4
2. (op_1 obj_10 obj_11 obj_02)
   deleted: (pred_1 obj_10 obj_11)
   added: (pred_1 obj_10 obj_02)
   goals met: 2 of 4
3. (op_1 obj_08 obj_02 obj_14)
   deleted: (pred_1 obj_08 obj_02)
   added: (pred_1 obj_08 obj_14)
   goals met: 2 of 4
4. (op_3 obj_10 obj_03 obj_02 obj_09)
   deleted: (pred_4 obj_03 obj_02) (pred_2 obj_10 obj_09)
   added: (pred_3 obj_10 obj_03 obj_09)
   goals met: 2 of 4
5. (op_1 obj_10 obj_02 obj_01)
   deleted: (pred_1 obj_10 obj_02)
   added: (pred_1 obj_10 obj_01)
   goals met: 2 of 4
6. (op_2 obj_10 obj_03 obj_01 obj_09)
   deleted: (pred_3 obj_10 obj_03 obj_09)
   added: (pred_4 obj_03 obj_01) (pred_2 obj_10 obj_09)
   goals met: 3 of 4
7. (op_3 obj_10 obj_12 obj_01 obj_06)
   deleted: (pred_4 obj_12 obj_01) (pred_2 obj_10 obj_06)
   added: (pred_3 obj_10 obj_12 obj_06)
   goals met: 3 of 4
8. (op_1 obj_10 obj_01 obj_02)
   deleted: (pred_1 obj_10 obj_01)
   added: (pred_1 obj_10 obj_02)
   goals met: 3 of 4
9. (op_2 obj_10 obj_12 obj_02 obj_06)
   deleted: (pred_3 obj_10 obj_12 obj_06)
   added: (pred_4 obj_12 obj_02) (pred_2 obj_10 obj_06)
   goals met: 4 of 4
